In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
dframe1 = pd.read_csv("readWriteTextFiles.csv")

In [5]:
dframe1

   q   r   s   t    apple
0  2   3   4   5     pear
1  a   s   d   f   rabbit
2  5   2   5   7      dog

In [9]:
dframe1 = pd.read_csv("readWriteTextFiles.csv", header = None)

In [11]:
dframe1

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [13]:
dframe2 = pd.read_table("readWriteTextFiles.csv", sep = ",", header = None)
dframe2

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [15]:
# getting x number of rows
dframe3 = pd.read_csv("readWriteTextFiles.csv", header = None, nrows = 2)
dframe3

   0   1   2   3       4
0  q   r   s   t   apple
1  2   3   4   5    pear

In [17]:
dframe1

   0   1   2   3        4
0  q   r   s   t    apple
1  2   3   4   5     pear
2  a   s   d   f   rabbit
3  5   2   5   7      dog

In [21]:
dframe1.to_csv("readWrite_out.csv")

In [23]:
import sys

In [25]:
dframe1.to_csv(sys.stdout)

,0,1,2,3,4
0,q, r, s, t, apple
1,2, 3, 4, 5, pear
2,a, s, d, f, rabbit
3,5, 2, 5, 7, dog

In [27]:
dframe1.to_csv(sys.stdout, sep = "_")

_0_1_2_3_4
0_q_ r_ s_ t_ apple
1_2_ 3_ 4_ 5_ pear
2_a_ s_ d_ f_ rabbit
3_5_ 2_ 5_ 7_ dog

In [29]:
dframe1.to_csv(sys.stdout, columns = [0, 1])

,0,1
0,q, r
1,2, 3
2,a, s
3,5, 2

In [ ]:
# Python csv stuff --- https://docs.python.org/3/library/csv.html